contextablemark/esp32-agui/agui-voice/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
# Route the console to the chip's native USB (USB Serial/JTAG) — that's what the board's
# USB-C exposes (VID 0x303a/PID 0x1001), not UART0. Lets ESP_LOG show over USB-C.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# app_main builds the LVGL chat UI (chat_ui_init) on the main task — the 3.5K default stack
# overflows during LVGL widget creation/layout. Give it room.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# TLS root certs for WSS (Soniox) / HTTPS — full bundle covers their CA chain.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Enable the TLS 1.3 client. The device was TLS-1.2-only, which caused edge-specific handshake
# failures: ngrok's ECDSA 1.2 path returned CONN_EOF (-0x7280), and the earlier workaround (force
# RSA-only ciphers) then broke Railway — no common 1.2 cipher → fatal alert (-0x7780). Modern edges
# (ngrok, Railway, Soniox) all negotiate TLS 1.3 natively, so enabling it lets the device speak the
# protocol both sides prefer, with the full cipher set kept (ECDSA re-enabled), and connect to all
# of them with no per-agent cipher juggling.
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_SSL_TLS1_3_KEXM_EPHEMERAL=y
# Put mbedTLS buffers in PSRAM. The C++ rearchitecture (agui_sdk + nlohmann + exception/RTTI tables)
# added ~30 KB of static internal .bss/.data and fragmented the internal heap: the largest free
# INTERNAL block fell to ~15 KB — below the contiguous ~16.7 KB mbedTLS needs for one TLS RX content
# buffer. It first showed as lwIP send stalls (E transport_ws: transport_poll_write(0)), then as
# outright handshake alloc failures ("Dynamic Impl: alloc(16725) failed" → mbedtls_ssl_handshake
# -0x7F00). EXTERNAL_MEM_ALLOC routes ALL mbedTLS allocations (the Soniox WSS *and* the AG-UI HTTPS
# runs) to PSRAM, which has megabytes of contiguous space — removing the internal contiguous-block
# bottleneck entirely. SSL_IN_CONTENT_LEN stays at the 16 KB default (safe for any server cert chain)
# since it no longer costs internal RAM. (mbedTLS buffers are CPU-accessed, not DMA, so PSRAM is fine;
# the WiFi driver keeps its own internal DMA buffers.)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# The vendored AG-UI C++ SDK (component agui_sdk) + nlohmann/json throw exceptions, and the SDK's
# event dispatch (subscriber.cpp / event_verifier.cpp) uses dynamic_cast — so the C++ runtime needs
# both exceptions and RTTI. The extern "C" shim (agui_client.cpp) catches everything at the C
# boundary so a stray exception can't reach app_main.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
# Let the WiFi + lwIP stacks allocate their (non-DMA) buffers from PSRAM instead of internal RAM.
# This is the other half of the Soniox-WSS internal-RAM fix: it gives lwIP room for outgoing
# pbufs/segments so socket writes don't stall under pressure. (DMA-capable buffers still stay
# internal automatically.)
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_DISP_DEF_REFR_PERIOD=4
CONFIG_LV_INDEV_DEF_READ_PERIOD=4
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
# Make lv_coord_t 32-bit. With it off, the usable coord range is only +/-8191 (top 3 bits are type
# tags), and lv_txt_get_size's overflow guard only trips at 32767 — so a tall chat column (flex of up
# to MAX_BUBBLES bubbles) can silently cross 8191 and corrupt scroll/clip math (blank/garbled scroll).
CONFIG_LV_USE_LARGE_COORD=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
# Chat UI uses only Montserrat 20 — make it the sole built-in glyph set AND the LVGL default font,
# so the unused 12/14/16/18 tables aren't compiled into flash. (14 is LVGL's stock default; disable
# it explicitly since the default font is now 20.)
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_20=y
# CONFIG_LV_FONT_MONTSERRAT_14 is not set
# LVGL demos disabled — our chat_ui owns the UI (P3+). (Were enabled in the source example.)
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_MUSIC=n

# Idle low-power step 3: automatic light sleep + DFS. SAFE this time because light sleep engages ONLY
# when idle on battery, where WiFi AND the codec/I2S are powered OFF (lp_idle in main releases the
# NO_LIGHT_SLEEP lock only after both are down). That removes BOTH failure sources: the associated-WiFi
# heap churn (earlier "STT failed to start") AND the I2S NO_LIGHT_SLEEP lock that otherwise blocks sleep.
# IRAM sleep opts stay OFF (they cost ~27 KB internal); CPU stays clock-gated (power-down off).
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# CONFIG_PM_SLP_IRAM_OPT is not set
# CONFIG_ESP_WIFI_SLP_IRAM_OPT is not set
# CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP is not set
# CONFIG_ESP_SYSTEM_PM_POWER_DOWN_CPU is not set
